{
  "name": "@slinerodev/github-releases-mcp",
  "description": "@slinerodev/github-releases-mcp MCP Server",
  "url": "@slinerodev/github-releases-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "github_release_info",
      "type": "tool",
      "description": "Get detailed information about a specific GitHub release version. Supports semantic versioning formats (v1.0.0, @1.0.0, 1.0.0) and returns comprehensive release details including tag name, release title, publication date, and full release notes. Perfect for understanding what changed in a specific version or for documentation purposes."
    },
    {
      "name": "github_releases_compare",
      "type": "tool",
      "description": "Compare changes between two GitHub release versions. Ideal for understanding what changed between versions, generating changelogs, or migration guides. Returns a chronological list of all releases between the two versions with their full release notes, making it perfect for analyzing the evolution of features, bug fixes, and breaking changes. Supports semantic versioning formats (v1.0.0, @1.0.0, 1.0.0)."
    },
    {
      "name": "github_releases_list",
      "type": "tool",
      "description": "List all GitHub releases for a repository with rich formatting and comprehensive details. Returns releases in chronological order with emojis for better readability (🔖 for versions, 🗓️ for dates, 📝 for descriptions). Perfect for getting an overview of a project's release history, finding the latest version, or monitoring release frequency. Supports pagination and filtering of pre-releases."
    },
    {
      "name": "github_org_packages",
      "type": "tool",
      "description": "List all packages for a GitHub organization. Returns detailed information about each package including its name, type, visibility, and repository details. Perfect for discovering available packages and their metadata in an organization."
    },
    {
      "name": "github_repo_readme",
      "type": "tool",
      "description": "Fetch the README file for a GitHub repository and return its plain text content. Useful for discovering package names and documentation in monorepos."
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "@slinerodev/github-releases-mcp"
    ],
    "env": {}
  },
  "_id": "3961a22d-3db9-430d-ae47-e2751be7bf04",
  "_registeredAt": "2025-05-06T11:07:01.641Z",
  "_updatedAt": "2025-05-06T11:07:01.641Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "3961a22d-3db9-430d-ae47-e2751be7bf04"
}