{
  "name": "@globalping/globalping-mcp",
  "description": "@globalping/globalping-mcp MCP Server",
  "url": "@globalping/globalping-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "globalping-ping",
      "type": "tool",
      "description": "Measures network latency (round-trip time) to a target host using ICMP Echo requests from globally distributed probes. Use to check global reachability, latency, and packet loss from different regions or networks. Results include min/avg/max times and packet loss statistics."
    },
    {
      "name": "globalping-traceroute",
      "type": "tool",
      "description": "Maps network paths between Globalping probes and a target, showing router hops and latency. Useful for identifying routing issues, network bottlenecks, and understanding geographic paths of network traffic. Supports multiple protocols (ICMP, TCP, UDP)."
    },
    {
      "name": "globalping-dns",
      "type": "tool",
      "description": "Performs DNS resolution queries from distributed probes to verify DNS propagation and configuration. Useful for checking DNS resolution from different regions, validating DNS changes, and diagnosing DNS-related issues. Supports all common DNS record types."
    },
    {
      "name": "globalping-mtr",
      "type": "tool",
      "description": "Combines traceroute and ping for comprehensive path analysis with detailed statistics per hop. Shows packet loss, latency (min/avg/max), jitter, and standard deviation for each network segment. Excellent for debugging complex network issues and performance problems."
    },
    {
      "name": "globalping-http",
      "type": "tool",
      "description": "Makes HTTP/HTTPS requests from distributed probes to measure web performance worldwide. Provides detailed timing breakdown (DNS, TCP, TLS, TTFB, download), status codes, headers, and response bodies. Perfect for testing CDN effectiveness, global availability, and identifying regional performance issues."
    },
    {
      "name": "globalping-limits",
      "type": "tool",
      "description": "Checks current Globalping API rate limits and authentication status. Shows available and remaining measurement quotas, reset time, and whether your API token is valid. Useful for troubleshooting API access issues or monitoring usage before running multiple tests."
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "@globalping/globalping-mcp"
    ],
    "env": {}
  },
  "_id": "3a7c7af5-7920-47e2-bd40-b37d980e98b3",
  "_registeredAt": "2025-05-06T10:20:11.244Z",
  "_updatedAt": "2025-05-06T10:20:11.244Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "3a7c7af5-7920-47e2-bd40-b37d980e98b3"
}