{
  "name": "mcp-desktop-pro",
  "description": "An advanced Model Context Protocol server for comprehensive computer use and AI agent automation with advanced window management, visual debugging, and Retina display support. This server enables AI operators and LLMs to intelligently control mouse movements, keyboard inputs, capture screenshots, manage and target specific windows, and perform precise autonomous computer control tasks with visual feedback and window-relative coordinate systems.",
  "url": "mcp-desktop-pro",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "get_screen_size",
      "type": "tool",
      "description": "Gets the screen dimensions"
    },
    {
      "name": "screen_capture",
      "type": "tool",
      "description": "Captures the current screen content (PRIMARY DISPLAY ONLY - cannot capture secondary/external displays. Use window_capture for windows on secondary displays. Automatically optimized for AI analysis)"
    },
    {
      "name": "keyboard_press",
      "type": "tool",
      "description": "Presses a keyboard key or key combination. IMPORTANT: windowId should be provided if known (after window_capture, list_windows, or when user specified a window)."
    },
    {
      "name": "keyboard_type",
      "type": "tool",
      "description": "Types text at the current cursor position. IMPORTANT: windowId should be provided if known (after window_capture, list_windows, or when user specified a window)."
    },
    {
      "name": "mouse_click",
      "type": "tool",
      "description": "Performs a mouse click, optionally moving to coordinates first. IMPORTANT: a windowId MUST be provided. Automatically creates coordinate metadata if not available from window_capture. For precise coordinate scaling, run window_capture first. COORDINATE SYSTEM: x,y coordinates must be relative to the TOP-LEFT corner (0,0) of the window screenshot/image, NOT relative to any internal UI elements. When clicking buttons (especially in grids like calculators), aim for the center of the button rather than edges to ensure reliable clicks."
    },
    {
      "name": "mouse_move",
      "type": "tool",
      "description": "Moves the mouse to specified coordinates within a given window. A windowId is required. Automatically creates coordinate metadata if not available from window_capture. For precise coordinate scaling, run window_capture first. COORDINATE SYSTEM: x,y coordinates must be relative to the TOP-LEFT corner (0,0) of the window screenshot/image, NOT relative to any internal UI elements. IMPORTANT: When clicking buttons (especially in grids like calculators), aim for the center of the button rather than edges to ensure reliable clicks."
    },
    {
      "name": "list_windows",
      "type": "tool",
      "description": "Lists all open windows with their properties. IMPORTANT: This is the preferred first tool to use and is obligatory when user asks about any window operations."
    },
    {
      "name": "focus_window",
      "type": "tool",
      "description": "Focuses on a specific window to bring it to the front"
    },
    {
      "name": "move_window_to_primary_screen",
      "type": "tool",
      "description": "Moves a window from secondary display to the primary screen, enabling screenshot capture. Automatically positions and optionally resizes the window to fit on the primary display."
    },
    {
      "name": "window_capture",
      "type": "tool",
      "description": "Focuses on a window and captures a screenshot of just that window (LIMITATION: coordinate handling for secondary displays not fully implemented - may not work reliably on non-primary displays. Automatically optimized for AI analysis)"
    },
    {
      "name": "multiple_desktop_actions",
      "type": "tool",
      "description": "Executes a sequence of desktop actions with optional delays and error handling"
    }
  ],
  "tags": [
    "ideal-for-ai-powered-automation",
    "testing-apps",
    "games",
    "and-running-desktop-tasks-locally-with-ai-agents-through-model-context-protocol"
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "mcp-desktop-pro"
    ]
  },
  "_id": "55d50a13-bb7f-48ab-ac58-519ee6623815",
  "_registeredAt": "2025-06-19T23:09:08.255Z",
  "_updatedAt": "2025-06-19T23:09:08.255Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_unverified": true,
  "_kvId": "55d50a13-bb7f-48ab-ac58-519ee6623815"
}