{
  "name": "@aashari/mcp-server-atlassian-bitbucket",
  "description": "@aashari/mcp-server-atlassian-bitbucket MCP Server",
  "url": "@aashari/mcp-server-atlassian-bitbucket",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "bb_ls_workspaces",
      "type": "tool",
      "description": "Lists Bitbucket workspaces accessible to the user. Supports pagination via `limit` and `cursor` (page number). Use this to discover available workspaces and find their `workspaceSlug` needed for other repository-related tools. Returns a formatted Markdown list of workspace memberships including name, slug, UUID, permission level, and dates. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_get_workspace",
      "type": "tool",
      "description": "Retrieves detailed information about a specific Bitbucket workspace using its slug (`workspaceSlug`). Includes UUID, name, type, creation date, and links to related resources (repositories, projects). Use this after finding a `workspaceSlug` to get its full details. Returns detailed workspace information formatted as Markdown. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_ls_repos",
      "type": "tool",
      "description": "Lists repositories within a workspace identified by `workspaceSlug`. Filters repositories by the user`s `role`, project key `projectKey`, or a `query` string (searches name/description). Supports sorting via `sort` and pagination via `limit` and `cursor`. Returns a formatted Markdown list. Requires Bitbucket credentials."
    },
    {
      "name": "bb_get_repo",
      "type": "tool",
      "description": "Retrieves detailed information for a specific repository identified by `workspaceSlug` and `repoSlug`. Returns comprehensive repository metadata as formatted Markdown, including owner, main branch, comment/task counts, recent pull requests, and relevant links. Requires Bitbucket credentials."
    },
    {
      "name": "bb_get_commit_history",
      "type": "tool",
      "description": "Retrieves the commit history for a repository identified by `workspaceSlug` and `repoSlug`. Supports pagination via `limit` and `cursor` (page number). Optionally filters history starting from a specific branch, tag, or hash using `revision`, or shows only commits affecting a specific file using `path`. Returns the commit history as formatted Markdown, including commit hash, author, date, and message. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_create_branch",
      "type": "tool",
      "description": "Creates a new branch in a specified Bitbucket repository. Requires the workspace slug (`workspaceSlug`), repository slug (`repoSlug`), the desired new branch name (`newBranchName`), and the source branch or commit hash (`sourceBranchOrCommit`) to branch from. Requires repository write permissions. Returns a success message."
    },
    {
      "name": "bb_ls_prs",
      "type": "tool",
      "description": "Lists pull requests for a repository identified by `workspaceSlug` and `repoSlug`. Allows filtering by `state` (OPEN, MERGED, DECLINED, SUPERSEDED) or `query` text and supports pagination via `limit` and `cursor` (page number). Use this to find PRs and their `prId` for other tools. Returns a formatted Markdown list including ID, title, state, author, branches, and description snippet. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_get_pr",
      "type": "tool",
      "description": "Retrieves detailed information for a specific pull request identified by `prId` within a repository (`workspaceSlug`, `repoSlug`). Returns the PR's full description, state, author, reviewers, branches, links, and either diff statistics or the full code diff if `includeFullDiff` is set to true. Use this after finding a `prId` to get its complete context and review changes. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_ls_pr_comments",
      "type": "tool",
      "description": "Lists comments (general and inline) for a specific pull request identified by `prId` within a repository (`workspaceSlug`, `repoSlug`). Supports pagination via `limit` and `cursor` (page number). Returns a formatted Markdown list of comments including author, date, content, and file context for inline comments. Use this to view review feedback and discussion threads. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_create_pr_comment",
      "type": "tool",
      "description": "Creates a comment with specified `content` on a pull request identified by `prId` within a repository (`workspaceSlug`, `repoSlug`). Supports both general PR comments and inline code comments via the optional `inline` object with `path` and `line` properties. Returns a confirmation message as Markdown upon successful creation. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_create_pr",
      "type": "tool",
      "description": "Creates a new pull request in a repository (`workspaceSlug`, `repoSlug`) with a `title` from `sourceBranch` to `destinationBranch` (defaults to main/master). Optionally includes a `description` and can automatically close the source branch when merged via `closeSourceBranch`. Returns formatted details of the newly created pull request as Markdown. Requires Bitbucket credentials to be configured."
    },
    {
      "name": "bb_search",
      "type": "tool",
      "description": "Searches Bitbucket content within a specified `workspaceSlug`. Requires a `query` string. Optionally scope the search using `scope` ('repositories', 'pullrequests', 'commits', 'code', or 'all' - default). The `code` scope supports filtering by `language` or `extension`. The 'pullrequests' and 'commits' scopes require `repoSlug`. Supports pagination via `limit` and `cursor` (or `page` for code scope). Returns formatted Markdown results. The 'all' scope automatically tries different scopes and prefixes the output indicating which scope returned results. Requires Bitbucket credentials."
    }
  ],
  "_id": "5bbed056-95a4-419a-ad04-a4de35193de6",
  "_registeredAt": "2025-05-05T16:00:05.214Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "5bbed056-95a4-419a-ad04-a4de35193de6"
}