{
  "name": "@nic0xflamel/lunarcrush-mcp-server",
  "description": "@nic0xflamel/lunarcrush-mcp-server MCP Server",
  "url": "@nic0xflamel/lunarcrush-mcp-server",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "API-get_public_coins_coin_time-series_v2",
      "type": "tool",
      "description": "Get market time series data on a coin or token. Specify the coin to be queried by providing the numeric ID or the symbol of the coin in the input parameter, which can be found by calling the /coins/list endpoint."
    },
    {
      "name": "API-get_public_coins_coin_v1",
      "type": "tool",
      "description": "Get market data on a coin or token. Specify the coin to be queried by providing the numeric ID or the symbol of the coin in the input parameter, which can be found by calling the /coins/list endpoint."
    },
    {
      "name": "API-get_public_coins_list_v2",
      "type": "tool",
      "description": "Get a general snapshot of LunarCrush metrics on the entire list of tracked coins. It is designed as a lightweight mechanism for monitoring the universe of available assets, either in aggregate or relative to each other. Metrics include Galaxy Score™, AltRank™, price, volatility, 24h percent change, market cap, social mentions, social interactions, social contributors, social dominance, and categories."
    },
    {
      "name": "API-get_public_topic_topic_news_v1",
      "type": "tool",
      "description": "Get the top news posts for a social topic. Top news is determined by the metrics related to the social posts that mention the news posts."
    },
    {
      "name": "API-get_public_topic_topic_posts_v1",
      "type": "tool",
      "description": "Get the top posts for a social topic. If start time is provided the result will be the top posts by interactions for the time range. If start is not provided it will be the most recent top posts by interactions from the last 24 hours."
    },
    {
      "name": "API-get_public_topic_topic_time-series_v2",
      "type": "tool",
      "description": "Get historical time series data for a social topic"
    },
    {
      "name": "API-get_public_topic_topic_v1",
      "type": "tool",
      "description": "Get summary information for a social topic. The output is a 24 hour aggregation social activity with metrics comparing the latest 24 hours to the previous 24 hours."
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "@nic0xflamel/lunarcrush-mcp-server"
    ],
    "env": {}
  },
  "_id": "777e9037-4d7c-4113-bc78-589093516ca6",
  "_registeredAt": "2025-05-06T11:20:24.242Z",
  "_updatedAt": "2025-05-06T11:20:24.242Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "777e9037-4d7c-4113-bc78-589093516ca6"
}