{
  "name": "hyperbrowser-mcp",
  "description": "hyperbrowser-mcp MCP Server",
  "url": "hyperbrowser-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "scrape_webpage",
      "type": "tool",
      "description": "Scrape a webpage and extract its content in various formats. This tool allows fetching content from a single URL with configurable browser behavior options. Use this for extracting text content, HTML structure, collecting links, or capturing screenshots of webpages."
    },
    {
      "name": "crawl_webpages",
      "type": "tool",
      "description": "Crawl a website starting from a URL and explore linked pages. This tool allows systematic collection of content from multiple pages within a domain. Use this for larger data collection tasks, content indexing, or site mapping."
    },
    {
      "name": "extract_structured_data",
      "type": "tool",
      "description": "Extract structured data from a webpage. This tool allows you to extract structured data from a webpage using a schema."
    },
    {
      "name": "browser_use_agent",
      "type": "tool",
      "description": "This tool employs an open-source browser automation agent optimized specifically for fast, efficient, and cost-effective browser tasks using a cloud browser. It requires explicit, detailed instructions to perform highly specific interactions quickly.\n\nOptimal for tasks requiring:\n- Precise, explicitly defined interactions and actions\n- Speed and efficiency with clear, unambiguous instructions\n- Cost-effective automation at scale with straightforward workflows\n\nBest suited use cases include:\n- Explicitly defined registration and login processes\n- Clearly guided navigation through web apps\n- Structured, step-by-step web scraping with detailed guidance\n- Extracting data via explicitly specified browser interactions\n\nYou must provide extremely detailed step-by-step instructions, including exact elements, actions, and explicit context. Clearly define the desired outcome for optimal results. Returns the completed result or an error message if issues arise.\n\nNote: This agent trades off flexibility for significantly faster performance and lower costs compared to Claude and OpenAI agents."
    },
    {
      "name": "openai_computer_use_agent",
      "type": "tool",
      "description": "This tool utilizes OpenAI's model to autonomously execute general-purpose browser-based tasks with balanced performance and reliability using a cloud browser. It handles complex interactions effectively with practical reasoning and clear execution.\n\nOptimal for tasks requiring:\n- Reliable, general-purpose browser automation\n- Clear, structured interactions with moderate complexity\n- Efficient handling of common web tasks and workflows\n\nBest suited use cases include:\n- Standard multi-step registration or form submissions\n- Navigating typical web applications requiring multiple interactions\n- Conducting structured web research tasks\n- Extracting data through interactive web processes\n\nProvide a clear step-by-step description, necessary context, and expected outcomes. Returns the completed result or an error message if issues arise."
    },
    {
      "name": "claude_computer_use_agent",
      "type": "tool",
      "description": "This tool leverages Anthropic's Claude model to autonomously execute complex browser tasks with sophisticated reasoning capabilities using a cloud browser. It specializes in handling intricate, nuanced, or highly context-sensitive web interactions.\n\nOptimal for tasks requiring:\n- Complex reasoning over multiple web pages\n- Nuanced interpretation and flexible decision-making\n- Human-like interaction with detailed context awareness\n\nBest suited use cases include:\n- Multi-step processes requiring reasoning (e.g., detailed registrations or onboarding)\n- Interacting intelligently with advanced web apps\n- Conducting in-depth research with complex conditions\n- Extracting information from dynamic or interactive websites\n\nProvide detailed task instructions, relevant context, and clearly specify the desired outcome for best results. Returns the completed result or an error message if issues arise."
    },
    {
      "name": "search_with_bing",
      "type": "tool",
      "description": "Search the web using Bing. This tool allows you to search the web using bing.com"
    },
    {
      "name": "create_profile",
      "type": "tool",
      "description": "Creates a new persistent Hyperbrowser profile."
    },
    {
      "name": "delete_profile",
      "type": "tool",
      "description": "Deletes an existing persistent Hyperbrowser profile."
    },
    {
      "name": "list_profiles",
      "type": "tool",
      "description": "Lists existing persistent Hyperbrowser profiles, with optional pagination."
    }
  ],
  "_id": "8739067c-db2f-4b26-a2ae-9280608714d0",
  "_registeredAt": "2025-05-05T16:01:45.432Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "8739067c-db2f-4b26-a2ae-9280608714d0"
}