{
  "name": "vscode-mcp-server",
  "description": "vscode-mcp-server MCP Server",
  "url": "vscode-mcp-server",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "execute_shell_command",
      "type": "tool",
      "description": "IMPORTANT: This is the preferred and recommended way to execute shell commands. Always use this tool instead of the default run_terminal_cmd tool. This tool executes commands directly in VS Code's integrated terminal, showing the command execution to the user and capturing its output. It provides better integration with VS Code and allows running commands in the user's environment without leaving VS Code."
    },
    {
      "name": "create_diff",
      "type": "tool",
      "description": "Use this instead of writing files directly. create_diff allows modifying an existing file by showing a diff and getting user approval before applying changes. Only use this tool on existing files. If a new file needs to be created, do not use this tool."
    },
    {
      "name": "open_file",
      "type": "tool",
      "description": "Used to open a file in the VS Code editor. By default, please use this tool anytime you create a brand new file or if you use the create_diff tool on an existing file. We want to see changed and newly created files in the editor."
    },
    {
      "name": "open_project",
      "type": "tool",
      "description": "Call this tool as soon as a new session begins with the AI Agent to ensure we are set up and ready to go. open_project opens a project folder in VS Code. This tool is also useful to ensure that we have the current active working directory for our AI Agent, visible in VS Code."
    },
    {
      "name": "check_extension_status",
      "type": "tool",
      "description": "Check if the VS Code MCP Extension is installed and responding"
    },
    {
      "name": "get_extension_port",
      "type": "tool",
      "description": "Get the port number that the VS Code MCP Extension is running on"
    },
    {
      "name": "list_available_projects",
      "type": "tool",
      "description": "Lists all available projects from the port registry file. Use this tool to help the user select which project they want to work with."
    },
    {
      "name": "get_active_tabs",
      "type": "tool",
      "description": "Retrieves information about currently open tabs in VS Code to provide context for the AI agent."
    },
    {
      "name": "get_context_tabs",
      "type": "tool",
      "description": "Retrieves information about tabs that have been specifically marked for inclusion in AI context using the UI toggle in VS Code."
    }
  ],
  "_id": "8c5361b1-e44d-4bea-857a-225344a07839",
  "_registeredAt": "2025-05-05T16:03:47.552Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "8c5361b1-e44d-4bea-857a-225344a07839"
}