{
  "name": "@aashari/mcp-server-atlassian-jira",
  "description": "@aashari/mcp-server-atlassian-jira MCP Server",
  "url": "@aashari/mcp-server-atlassian-jira",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "jira_ls_projects",
      "type": "tool",
      "description": "Lists Jira projects accessible to the user, optionally filtering by name/key (`name`) or sorting (`orderBy`). Use this to discover available projects and find project keys/IDs needed for other tools (like `jira_get_project` or `jira_list_issues`). Supports pagination via `limit` and `startAt`. Returns a formatted list of projects including key, name, type, style, lead, and URL. **Note:** Default sort is by most recently updated issue time. Requires Jira credentials to be configured."
    },
    {
      "name": "jira_get_project",
      "type": "tool",
      "description": "Retrieves comprehensive details for a specific Jira project using its key or ID (`projectKeyOrId`). Includes description, lead, components, versions, and other metadata. Use this after finding a project key/ID via `jira_list_projects` to get its full details. Returns detailed project information formatted as Markdown. Requires Jira credentials to be configured."
    },
    {
      "name": "jira_ls_issues",
      "type": "tool",
      "description": "Searches for Jira issues using flexible filtering criteria. You can provide a full JQL query via `jql` for complex filtering, or use specific filters like `projectKeyOrId` and `statuses`. Sort results using `orderBy` (e.g., \"priority DESC\"). Supports pagination via `limit` and `startAt`. Returns a formatted list of matching issues including key, summary, type, status, priority, and project. Default sort is by last updated date. \n+**Important Note:** JQL functions relying on user context (like `currentUser()`) may not work reliably with API token authentication and could cause errors; use specific account IDs (e.g., `assignee = 'accountid:...'`) instead when using JQL.\n**Note:** If `jql` is provided and already includes an ORDER BY clause, the `orderBy` parameter will be ignored. Requires Jira credentials to be configured."
    },
    {
      "name": "jira_get_issue",
      "type": "tool",
      "description": "Retrieves comprehensive details for a specific Jira issue identified by `issueIdOrKey`. Returns the issue's description, status, priority, assignee, reporter, comments, attachments, and linked issues as formatted Markdown. Also includes linked development information (commits, branches, PRs) when available. Use this after finding an issue key to get its complete context. Requires Jira credentials to be configured."
    },
    {
      "name": "jira_ls_statuses",
      "type": "tool",
      "description": "Lists available Jira statuses, either globally or for a specific project (`projectKeyOrId`).\nUse this to discover valid status names and IDs needed for filtering issues (e.g., in `jira_ls_issues`).\nNote: This tool returns *all* available statuses and does not support pagination (`limit`, `cursor`) due to API limitations.\nReturns a formatted Markdown list of statuses including name, ID, description, and category (To Do, In Progress, Done).\nRequires Jira credentials to be configured."
    }
  ],
  "_id": "a97e8870-4ea5-4d30-8334-ca98d23b96e8",
  "_registeredAt": "2025-05-05T16:03:34.551Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "a97e8870-4ea5-4d30-8334-ca98d23b96e8"
}