{
  "name": "rhombus-node-mcp",
  "description": "rhombus-node-mcp MCP Server",
  "url": "rhombus-node-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "get-org-information",
      "type": "tool",
      "description": "Get general information about the organization including org name, camera configuration defaults, contact information, and org settings."
    },
    {
      "name": "create-tool",
      "type": "tool",
      "description": "Tool for creating many entity types such as video walls."
    },
    {
      "name": "time-tool",
      "type": "tool",
      "description": "Tool for converting a natural language time description into a timestamp in milliseconds."
    },
    {
      "name": "get-entity-tool",
      "type": "tool",
      "description": "get a list of entities like cameras, access controlled doors, sensors, etc"
    },
    {
      "name": "camera-tool",
      "type": "tool",
      "description": "This tool captures and returns a real-time snapshot from a designated security camera. The image reflects the current scene in the camera's field of view and serves as a contextual input source for downstream tasks such as object recognition, anomaly detection, incident investigation, or situational assessment. When invoked, the tool provides the following: \n •\tVisual Scene Capture: A high-resolution image of what the camera is actively observing, including people, vehicles, license plates, and any detectable objects. \n•\tScene Context: Metadata such as camera ID, location name, timestamp, and motion detection status if available. \n•\tEnriched Data Potential: The image can be paired with AI models or downstream analytics to extract insights such as: \n•\tNumber and type of objects in frame (e.g., humans, cars, packages) \n•\tUnusual behaviors (e.g., loitering, unauthorized access) \n•\tEnvironmental conditions (e.g., lighting, obstruction, cleanliness) \nUse Cases: \n•\tVerify what triggered a motion alert or analytic rule. \n•\tProvide visual context for access events or alarms. \n•\tSupport live incident triage or retrospective investigations. \n•\tFeed contextual imagery to agents making security or operational decisions. \nInvocation Notes: \nTo use this tool correctly, the agent should provide the specific camera identifier or location name. If possible, include the intent (e.g., \"verify unauthorized access\", \"identify vehicle\", \"check for obstructions\") to enhance downstream processing or summarization."
    },
    {
      "name": "events-tool",
      "type": "tool",
      "description": "event data for certain types of information like faces and license plates"
    },
    {
      "name": "location-tool",
      "type": "tool",
      "description": "contains basic operations for locations and response in JSON format."
    },
    {
      "name": "reboot-cameras",
      "type": "tool",
      "description": "this tool is for rebooting one or more cameras causing them to reconnect to the server, this is a helpful option when a camera is experiencing connectivity issues or is in need of troubleshooting"
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "rhombus-node-mcp"
    ],
    "env": {}
  },
  "_id": "cf4a0053-e1a3-4fd2-b39d-ecbf0a0f2634",
  "_registeredAt": "2025-05-06T10:32:55.385Z",
  "_updatedAt": "2025-05-06T10:32:55.385Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "cf4a0053-e1a3-4fd2-b39d-ecbf0a0f2634"
}