{
  "name": "@codacy/codacy-mcp",
  "description": "@codacy/codacy-mcp MCP Server",
  "url": "@codacy/codacy-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "codacy_get_pattern",
      "type": "tool",
      "description": "Get the definition of a specific pattern. \n \n  Common use cases: \n  - When the user asks for the definition of a specific pattern\n  - When the user asks for more information about an issue found by Codacy\n\n  Common mistakes: \n  - Using this tool with the wrong toolUuid\n  - Using this tool with the wrong patternId\n"
    },
    {
      "name": "codacy_list_tools",
      "type": "tool",
      "description": "List all code analysis tools available in Codacy."
    },
    {
      "name": "codacy_cli_analyze",
      "type": "tool",
      "description": "Run quality analysis locally using Codacy CLI. \n \n  Use this tool to analyze the quality of a repository using Codacy command line.\n\n  Common use cases: \n  - When the user asks for an analysis of a repository\n  - When the user asks to scan the code\n  - When the user wants to analyze based on Codacy configuration\n  - When the user wants to apply fixes based on Codacy configuration and analysis\n  - When the user wants Codacy results immediately without waiting for the next scheduled analysis\n\n  Common mistakes: \n  - Using this tool to know the status of a repository\n  - Using this tool without specifying the rootPath\n  - Using this tool to know current results from Codacy. Use codacy_get_repository_with_analysis instead.\n  - Filling the tool parameter when not asked specifically for it.\n  \n  - Using this tool for a organization other than the current one\n  - Using this tool with the wrong organization name (if you are not sure, use the codacy_list_organizations tool to validate the organization name)\n\n  \n  - Using this tool without specifying the repository name \n  - Using this tool for a repository other than the current one\n  - Using this tool with the wrong repository name (if you are not sure, use the codacy_list_organization_repositories tool to validate the repository name)\n\n"
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "@codacy/codacy-mcp"
    ],
    "env": {}
  },
  "_id": "e5294b55-3bc9-4ba6-b3d1-4a16e32f7753",
  "_registeredAt": "2025-05-07T21:50:53.249Z",
  "_updatedAt": "2025-05-07T21:50:53.249Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "e5294b55-3bc9-4ba6-b3d1-4a16e32f7753"
}