{
  "name": "mcp-dev-server",
  "description": "mcp-dev-server MCP Server",
  "url": "mcp-dev-server",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "start_dev_server",
      "type": "tool",
      "description": "Starts a development server in the background using a specified command and assigns it a unique label. Returns status and initial logs (ANSI codes stripped). Handles verification and basic crash detection/retry."
    },
    {
      "name": "check_dev_server_status",
      "type": "tool",
      "description": "Checks the status and recent logs (ANSI codes stripped) of a development server using its label. Verifies if the process still exists."
    },
    {
      "name": "stop_dev_server",
      "type": "tool",
      "description": "Stops a specific development server using its label and verifies the stop. Returns final status and recent logs (ANSI codes stripped). Handles stop timeouts."
    },
    {
      "name": "list_dev_servers",
      "type": "tool",
      "description": "Lists all currently managed development servers and their statuses."
    },
    {
      "name": "stop_all_dev_servers",
      "type": "tool",
      "description": "Stops all currently running or starting development servers managed by this tool and verifies."
    },
    {
      "name": "restart_dev_server",
      "type": "tool",
      "description": "Stops (if running) and then starts a development server with the same configuration. Returns final status and initial logs from the start phase."
    },
    {
      "name": "wait_for_dev_server",
      "type": "tool",
      "description": "Waits for a specific development server to reach a target status (usually 'running' after a start/restart) within a timeout. Checks status periodically. Use this after starting or restarting a server to ensure it's ready before proceeding."
    },
    {
      "name": "health_check",
      "type": "tool",
      "description": "Provides an overall health status of the MCP Dev Server Manager itself, including managed process counts, resource usage, zombie check status, and potential issues like leaks or crash loops."
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "mcp-dev-server"
    ],
    "env": {}
  },
  "_id": "ec4187f5-2533-41c4-8852-4c95319c01a9",
  "_registeredAt": "2025-05-06T10:45:48.314Z",
  "_updatedAt": "2025-05-06T10:45:48.314Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "ec4187f5-2533-41c4-8852-4c95319c01a9"
}