{
  "name": "azure-appconfiguration-helper-mcp",
  "description": "azure-appconfiguration-helper-mcp MCP Server",
  "url": "azure-appconfiguration-helper-mcp",
  "protocol_version": "MCP/1.0",
  "capabilities": [
    {
      "name": "get-configuration-provider-overview",
      "type": "tool",
      "description": "Returns the overview documentation URL for the Azure App Configuration. AI agent should use web fetch tool to read the URL when it is asked for anything about Azure App Configuration client library."
    },
    {
      "name": "get-configuration-provider-documentation",
      "type": "tool",
      "description": "Returns the full feature reference documentation URL for the Azure App Configuration for the specified programming language or framework. AI agent should use web fetch tool to read the URL when it is asked for anything about Azure App Configuration in any specific programming language."
    },
    {
      "name": "get-feature-management-overview",
      "type": "tool",
      "description": "Returns the overview documentation URL for the Azure App Configuration feature managmenet library. AI agent should use web fetch tool to read the URL when it is asked for anything about Azure App Configuration feature flags."
    },
    {
      "name": "get-feature-management-documentation",
      "type": "tool",
      "description": "Returns the full feature reference documentation URL for the Azure App Configuration feature management library for the specified programming language or framework. AI agent should use web fetch tool to read the URL when it is asked for anything about Azure App Configuration feature flags in any specific programming language."
    }
  ],
  "installation": {
    "command": "npx",
    "args": [
      "-y",
      "azure-appconfiguration-helper-mcp"
    ],
    "env": {}
  },
  "_id": "f4cf2ae0-15ee-4338-9af9-1bff280bac11",
  "_registeredAt": "2025-05-06T10:40:45.005Z",
  "_updatedAt": "2025-05-06T10:40:45.005Z",
  "_status": "unknown",
  "_lastChecked": null,
  "_kvId": "f4cf2ae0-15ee-4338-9af9-1bff280bac11"
}